app/controllers/textures_controller.rb

  def index
    @textures = Texture.all
---
SELECT "textures".* FROM "textures"

  def create
    @texture = Texture.new(texture_params)

    respond_to do |format|
      if @texture.save
---
INSERT INTO "textures" ("name", "url", "sizePixelsX", "sizePixelsY", "created_at", "updated_at") VALUES ('Wood', 'https://slm-assets.secondlife.com/assets/29679434/view_large/Dark%20Wood%20Floor.jpg?1625687116', 345, 345, '2025-02-21 20:23:43.057503', '2025-02-21 20:23:43.057503') RETURNING "id"

  def update
    respond_to do |format|
      if @texture.update(texture_params)
---
UPDATE "textures" SET "sizePixelsX" = 340, "updated_at" = '2025-02-21 20:23:58.693481' WHERE "textures"."id" = 1

  def destroy
    @texture.destroy!
---
DELETE FROM "textures" WHERE "textures"."id" = 5

    def set_texture
      @texture = Texture.find(params.expect(:id))
---
SELECT "textures".* FROM "textures" WHERE "textures"."id" = 1 LIMIT 1