app/controllers/texture_groups_controller.rb

SELECT "texture_groups".* FROM "texture_groups"
---
  def index
    @texture_groups = TextureGroup.all

INSERT INTO "texture_groups" ("material", "refined", "smoothRepeat", "created_at", "updated_at") VALUES ('Brick', 1, 1, '2025-02-22 18:37:53.545990', '2025-02-22 18:37:53.545990') RETURNING "id"
---
  def create
    @texture_group = TextureGroup.new(texture_group_params)

    respond_to do |format|
      if @texture_group.save

SELECT "texture_groups".* FROM "texture_groups" WHERE "texture_groups"."id" = 1 LIMIT 1
---
    def set_texture_group
      @texture_group = TextureGroup.find(params.expect(:id))